src/Catalogs/дкл_НастройкиСкладовЛифтов/дкл_НастройкиСкладовЛифтов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>дкл_НастройкиСкладовЛифтов</name>
  <attributes>
    <name>machineId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АвтодобавлениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтопереводОрдеровВСтатусReady</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияМеханики</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидАСХ</name>
    <type>
      <types>EnumRef.дкл_ВидыАСХ</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодПроизводства</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаЭксплуатации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнегоТО</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЗонВыдачи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Линия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоположениеWSDL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МестоУстановки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Модель</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательОповещений</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СерийныйНомер</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Стеллаж</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПодключения</name>
    <type>
      <types>EnumRef.дкл_СпособПодключения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиОповещений</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УдалитьПолки</name>
    <attributes>
      <name>trayNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>title</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>width</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>depth</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>weight</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>barcode</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ярус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/дкл_НоменклатураСкладов/дкл_НоменклатураСкладов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>дкл_НоменклатураСкладов</name>
  <resources>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.дкл_Статусы</types>
    </type>
  </resources>
  <resources>
    <name>СопоставленоВручную</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>itemId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>extraCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>itemName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>unit</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>vendorNumber</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>height</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>width</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>depth</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>weight</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>barcode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>НастройкаСклада</name>
    <type>
      <types>CatalogRef.дкл_НастройкиСкладовЛифтов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/дкл_Статусы/дкл_Статусы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>дкл_Статусы</name>
  <enumValues>
    <name>Изменено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/дкл_НастройкиСкладовЛифтов/Forms/СопоставлениеНоменклатуры/Module.bsl
#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НастройкаСклада") Тогда 
		//@skip-check wrong-string-literal-content
		НастройкаСклада = Параметры["НастройкаСклада"];
		ЗаполнитьТаблицу();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблица

&НаКлиенте
Процедура ТаблицаНоменклатураПриИзменении(Элемент)
	Элементы.Таблица.ТекущиеДанные.СопоставленоВручную = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоШтрихкоду(Команда)
	ПоШтрихкодуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоКоду(Команда)
	ПоКодуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоНаименованию(Команда)
	ПоНаименованиюНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоАртиклу(Команда)
	ПоАртиклуНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	ЗаписатьИзмененияНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзмененияНаСервере()
	
	// ищем активную настройку склада-получателя
	Активность = Истина;
	ДанныеНастройкиСклада = Справочники.дкл_НастройкиСкладовЛифтов.ДанныеНастройкиСклада(НастройкаСклада, Активность);
	
	Если НЕ ЗначениеЗаполнено(ДанныеНастройкиСклада) Тогда 
		Возврат;		
	КонецЕсли;
	
	Отбор = Новый Структура("СопоставленоВручную", Истина);
	Таб = Таблица.Выгрузить(Отбор);                         
	
	Если Таб.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
	СтрокиКУдалению = Таб.НайтиСтроки(Отбор);
	
	Для каждого Стр Из СтрокиКУдалению Цикл 
		Таб.Удалить(Стр); 
	КонецЦикла; 
	
	Для каждого Стр Из Таб Цикл

		МенеджерЗаписи = РегистрыСведений.дкл_НоменклатураСкладов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Стр);
		МенеджерЗаписи.НастройкаСклада = НастройкаСклада;
		МенеджерЗаписи.Активна = Истина;
		МенеджерЗаписи.Статус = Перечисления.дкл_Статусы.Отправлено;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу()

	Таблица.Очистить();
	
	Результат = дкл_ОбменДаннымиСервер.ПолучитьСписокНоменклатуры(НастройкаСклада); 

	Для каждого Стр Из Результат.item Цикл

		Нов = Таблица.Добавить();                                                                     
		ЗаполнитьЗначенияСвойств(Нов, Стр);
		//@skip-check query-in-loop
		Нов.Номенклатура = НайтиНоменклатуруВСправочникеИлиВРегистре(Стр);

	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция НайтиНоменклатуруВСправочникеИлиВРегистре(Стр)

	Номенклатура = Справочники.Номенклатура.ПолучитьСсылку(
			Новый УникальныйИдентификатор(Стр.itemId));		

	Если Лев(Строка(Номенклатура), 17) = "<Объект не найден" Тогда 
		Номенклатура = Неопределено;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	дкл_НоменклатураСкладов.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.дкл_НоменклатураСкладов КАК дкл_НоменклатураСкладов
		|ГДЕ
		|	дкл_НоменклатураСкладов.СопоставленоВручную
		|	И дкл_НоменклатураСкладов.itemId = &itemId
		|	И дкл_НоменклатураСкладов.НастройкаСклада = &НастройкаСклада";
		
		Запрос.УстановитьПараметр("itemId", Стр.itemId);
		Запрос.УстановитьПараметр("НастройкаСклада", НастройкаСклада);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		
	КонецЕсли;    
	
	Возврат Номенклатура;
	
КонецФункции // ()

&НаСервере
Процедура ПоАртиклуНаСервере()

	Запрос = Новый Запрос;                                      
	Запрос.УстановитьПараметр("Таб", Таблица.Выгрузить(,"vendorNumber"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК СопоставленоВручную,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Артикул КАК vendorNumber
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул В(&Таб)
		|	И НЕ Номенклатура.Артикул = """"
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Отбор = Новый Структура("vendorNumber");
	
	Для каждого Стр Из Таблица Цикл        
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Продолжить;                    
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, Стр);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПоКодуНаСервере()

	Запрос = Новый Запрос;                                      
	Запрос.УстановитьПараметр("Таб", Таблица.Выгрузить(,"extraCode"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК СопоставленоВручную,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Код КАК extraCode
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Код В(&Таб)
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Отбор = Новый Структура("extraCode");
	
	Для каждого Стр Из Таблица Цикл        
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Продолжить;                    
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, Стр);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоНаименованиюНаСервере()

	Запрос = Новый Запрос;                                      
	Запрос.УстановитьПараметр("Таб", Таблица.Выгрузить(,"itemName"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК СопоставленоВручную,
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.Наименование КАК itemName
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Наименование В(&Таб)
		|	И НЕ Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Отбор = Новый Структура("itemName");
	
	Для каждого Стр Из Таблица Цикл        
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Продолжить;                    
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, Стр);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПоШтрихкодуНаСервере()
	
	Запрос = Новый Запрос;                                      
	Запрос.УстановитьПараметр("Таб", Таблица.Выгрузить(,"barcode"));
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК СопоставленоВручную,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК barcode
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод В(&Таб)
		|	И НЕ ШтрихкодыНоменклатуры.Штрихкод = """"
		|	И НЕ ШтрихкодыНоменклатуры.Номенклатура.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Отбор = Новый Структура("barcode");
	
	Для каждого Стр Из Таблица Цикл        
		
		Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
			Продолжить;                    
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Отбор, Стр);
		Выборка.Сбросить();
		Если Выборка.НайтиСледующий(Отбор) Тогда
			ЗаполнитьЗначенияСвойств(Стр, Выборка);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
